Dokumentation/husky/RegistryStoredQuerySample.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <saml2:Assertion
        xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
        xmlns:xs="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        ID="_bf472c00-8821-4eba-ab02-1d8124949e3b"
        IssueInstant="2022-09-05T12:49:06.501Z"
        Version="2.0">
        <saml2:Issuer>https://ehealthsuisse.ihe-europe.net/STS</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_bf472c00-8821-4eba-ab02-1d8124949e3b">
              <ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>nRc5EQq2oIlp1+aM0l+SElXLFaA=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>Qp8PxfBF5CraeGnvZXdybM1fM3KAf+iM0cgdgqcT6z93OIByRGkPtqbcRXgRgj+xAfUGrdRvrvVg1sjCNpDiqHTo6j9bffG4wdNzo/nKOWuQYFWi1RMqzWI3x8C0JFe2tw5P/WBj+1x31rQgEvj1UFr92X7AZu0VOH7F381dZbw=</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>MIIDhjCCAu+gAwIBAgIBCzANBgkqhkiG9w0BAQ0FADBFMQswCQYDVQQGEwJDSDEMMAoGA1UECgwD SUhFMSgwJgYDVQQDDB9laGVhbHRoc3Vpc3NlLmloZS1ldXJvcGUubmV0IENBMB4XDTE3MDMyMjE2 MDgyNFoXDTI3MDMyMjE2MDgyNFowQjELMAkGA1UEBhMCQ0gxDDAKBgNVBAoMA0lIRTElMCMGA1UE
                AwwcZWhlYWx0aHN1aXNzZS5paGUtZXVyb3BlLm5ldDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkC gYEAw5dTR17Y1w9cIhY0XSP9Cx7ThQ05YZTf4pKGgGb5ZZbFqm9Q5EKIrJT2EHE7MGO6D/miU3Jt BUmexcf9ceftSXEW+FaNVAqDePBst4l2RSZeJvez0FmcbWcPeufsUumcGXGAJmNmSviMLd1IrMEh
                whv6wuQvspY0Y2wAOvSkUmECAwEAAaOCAYcwggGDMEoGA1UdHwRDMEEwP6A9oDuGOWh0dHBzOi8v ZWhlYWx0aHN1aXNzZS5paGUtZXVyb3BlLm5ldC9nc3MvY3JsLzIyL2NhY3JsLmNybDBIBglghkgB hvhCAQQEOxY5aHR0cHM6Ly9laGVhbHRoc3Vpc3NlLmloZS1ldXJvcGUubmV0L2dzcy9jcmwvMjIv
                Y2FjcmwuY3JsMEgGCWCGSAGG+EIBAwQ7FjlodHRwczovL2VoZWFsdGhzdWlzc2UuaWhlLWV1cm9w ZS5uZXQvZ3NzL2NybC8yMi9jYWNybC5jcmwwCQYDVR0TBAIwADAOBgNVHQ8BAf8EBAMCBPAwEQYJ YIZIAYb4QgEBBAQDAgXgMB0GA1UdDgQWBBSG1oKBcZvZJWlqKJ9i/67Htv7frDAfBgNVHSMEGDAW
                gBQol+/d3jFYbFbyhkbiEeQ+OHFfLzAzBgNVHSUELDAqBggrBgEFBQcDAgYIKwYBBQUHAwQGCisG AQQBgjcUAgIGCCsGAQUFBwMBMA0GCSqGSIb3DQEBDQUAA4GBAI1OT9P0oSrfNedZ4T4CfxPoUOFC D1tU2X3iRAZFPoUHeFBiccsqMYnNlo3S2cKP6gxt+QPTGNSs171sS0MLa73aR8qrQC+vl5ZP7q4+
                /3hYQLe+z3DjSflZNW6shSAp4vD43Dnd8OzgX41LRw1gSEWuAK/+7CedM6IkFEUV2NSF</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:gs1:gln">7601002469191</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData InResponseTo="_43ef3e4fefdb03a31781d7ea52617674bcd25a6c26" NotOnOrAfter="2022-09-05T14:49:06.501Z" Recipient="https://sp.community.ch/epd"/></saml2:SubjectConfirmation>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2022-09-05T12:49:06.501Z" NotOnOrAfter="2022-09-05T14:49:06.501Z">
          <saml2:AudienceRestriction>
            <saml2:Audience>urn:e-health-suisse:token-audience:all-communities</saml2:Audience>
          </saml2:AudienceRestriction>
        </saml2:Conditions>
        <saml2:AuthnStatement AuthnInstant="2022-09-05T12:49:06.501Z" SessionNotOnOrAfter="2022-09-05T14:49:06.501Z">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>http://bag.admin.ch/LoA/3</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
            <saml2:AttributeValue>Ann Andrews</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
            <saml2:AttributeValue><Role xmlns="urn:hl7-org:v3" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPR Akteure" displayName="Gesundheitsfachperson" xsi:type="CE"/></saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
            <saml2:AttributeValue>Spital Y</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
            <saml2:AttributeValue>urn:oid:2.16.10.89.211</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId">
            <saml2:AttributeValue>urn:oid:1.1.4567334.1.6</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
            <saml2:AttributeValue>761337610411265304^^^SPID&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
            <saml2:AttributeValue><PurposeOfUse xmlns="urn:hl7-org:v3" code="NORM" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Normalzugriff" xsi:type="CE"/></saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
    </wsse:Security>
    <Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQuery</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:38d78e61-c3b6-43dc-9319-b341861e6506</MessageID>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://ehealthsuisse.ihe-europe.net:8280/xdstools7/sim/epr-testing__for_init_gw_testing/rep/xcq</To>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
  </soap:Header>
  <soap:Body>
    <ns4:AdhocQueryRequest
      xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
      xmlns:ns5="urn:ihe:iti:xds-b:2007"
      xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
      xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
      xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
      <ns4:ResponseOption returnType="LeafClass" returnComposedObjects="true"/>
      <ns2:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <ns2:Slot name="$XDSDocumentEntryFormatCode">
          <ns2:ValueList>
            <ns2:Value>('urn:che:epr:EPR_Unstructured_Document^^2.16.756.5.30.1.127.3.10.10')</ns2:Value>
          </ns2:ValueList>
        </ns2:Slot>
        <ns2:Slot name="$XDSDocumentEntryClassCode">
          <ns2:ValueList>
            <ns2:Value>('184216000^^2.16.840.1.113883.6.96')</ns2:Value>
          </ns2:ValueList>
        </ns2:Slot>
        <ns2:Slot name="$XDSDocumentEntryTypeCode">
          <ns2:ValueList>
            <ns2:Value>('41000179103^^2.16.840.1.113883.6.96')</ns2:Value>
          </ns2:ValueList>
        </ns2:Slot>
        <ns2:Slot name="$XDSDocumentEntryPatientId">
          <ns2:ValueList>
            <ns2:Value>'IHERED-1024^^^&amp;1.3.6.1.4.1.21367.13.20.1000&amp;ISO'</ns2:Value>
          </ns2:ValueList>
        </ns2:Slot>
        <ns2:Slot name="$XDSDocumentEntryStatus">
          <ns2:ValueList>
            <ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</ns2:Value>
          </ns2:ValueList>
        </ns2:Slot>
      </ns2:AdhocQuery>
    </ns4:AdhocQueryRequest>
  </soap:Body>
</soap:Envelope>
