validators-registry-metadata/src/test/resources/RegistryStoredQuery-request.txt

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://172.16.0.150:10000/tf6/services/xdsregistryb</To><Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:RegistryStoredQuery</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">uuid:8051dc3b-d63d-4ac6-a760-cc4a7c45de89</MessageID></S:Header><S:Body><ns2:AdhocQueryRequest xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns7="urn:hl7-org:v3"><ns2:ResponseOption returnComposedObjects="true" returnType="LeafClass"></ns2:ResponseOption><ns3:AdhocQuery id="urn:uuid:f26abbcb-ac74-4422-8a30-edb644bbc1a9"><ns3:Slot name="$XDSSubmissionSetPatientId"><ns3:ValueList><ns3:Value>'Test^^^&amp;1.3.6.1.4.1.21367.13.20.1000&amp;ISO'</ns3:Value></ns3:ValueList></ns3:Slot><ns3:Slot name="$XDSSubmissionSetStatus"><ns3:ValueList><ns3:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</ns3:Value></ns3:ValueList></ns3:Slot></ns3:AdhocQuery></ns2:AdhocQueryRequest></S:Body></S:Envelope>